<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"172373e22fc270a8bd7cec5ee2f69f38d39dfd076ad1f64bf44a8b64f7bc4ce5","plan_job_ref":"Job plan #8 at https://github.com/GSA/usnotify-ssb/actions/runs/4235910909","plan_hash":"53674954ceb0315380ab200b30130ca1ea1206240d9d5d9f6a93ceeec729c0b4","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-demo"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
      + url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov"
      + username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-demo"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
      + url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov"
      + username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [apply #9](https://github.com/GSA/usnotify-ssb/actions/runs/4235921090)